PLACE_TYPES = {
    'Бар': (
        'Бар',
        'Суши-бары',
    ),
    'Ресторан': (
        'Sushi-bars / Restaurants',
        'Restaurants',
        'Cafe / Restaurants',
        'Рестораны',
    ),
    'Кафе': (
        'Coffee shop',
        'Кафе',
    ),
    'Пиццерия': (
        'Пиццерии',
        'Пиццерия',
    ),
    'Фастфуд': (
        'Фастфуд',
        'Быстрое питание',
        'Cafe / fast food restaurants',
    ),
    'Суши бар': (
        'Sushi-bars / Restaurants',
        'Суши-бары',
    ),
    'Кофейня': (
        'Пекарни',
        'Coffee shop',
    ),
    'Караоке': ('Караоке-залы',),
    'Ночной клуб': ('Ночные клубы',),
}
KEYWORDS = (
    'бар',
    'ресторан',
    'кафе',
)
CITY_ID = {
    'Орел': 9992984443486357,
    'Болхов': 70030076127877656,
    'Мценск': 70030076127876527,
    'Суджа': 70030076128107843,
    'Москва': 4504222397630173,
    'Курск': 10274459420196967,
    'Белгород': 6474547234603025,
}
# id типов заведений по 2 gis (кафе, ресторан, бар и т.п.)
RUBRIC_ID = '164,165,161,21387,15791,15791,159,111594,110530,51459,16677,173'
MAX_QUANTITY_OF_PLACES_ON_KB = 12
